#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```terraform
module.BinhMinhERP.cloudflare_record.binhminh_erp_sendgrid_3: Refreshing state... [id=c637dde6b0a6ca0b95a9290488db1e4f]
module.PersonalBlog.cloudflare_record.www_megatunger: Refreshing state... [id=b98af5802fc48600cad3132f0f56f7cd]
module.BinhMinhIdCardAPI.cloudflare_record.bmidcard_api: Refreshing state... [id=6e9cfbacb5fa5c433735b7be41fee631]
module.BinhMinhERP.cloudflare_record.binhminh_erp_sendgrid_4: Refreshing state... [id=b4f9e88334045a0e35152b58812bb713]
module.TestReady.cloudflare_record.www_testready: Refreshing state... [id=f6c9a4e7941a8e864238a3cceadd1cef]
module.PersonalBlog.cloudflare_record.megatunger: Refreshing state... [id=284f02403cab8e2f8169585c87c2106d]
module.BinhMinhERP.cloudflare_record.binhminh_erp_sendgrid_2: Refreshing state... [id=a5375d4fa013a7250d1f22dd5cb23e47]
module.BinhMinhERP.cloudflare_record.binhminh_erp_sendgrid_1: Refreshing state... [id=3582aff137e0b139f4a62723944643ef]
module.BinhMinhERP.cloudflare_record.binhminh_erp_sendgrid_5: Refreshing state... [id=b6758c86fbd62dec46e0ad573d11fbc4]
module.uCall.cloudflare_record.ucall_app: Refreshing state... [id=c6a1bd9db047f5d39d100bfc45ffd9ac]
module.TestReady.cloudflare_record.testready: Refreshing state... [id=633b4e558148faceea66d6e1d5880876]
module.uCall.cloudflare_record.ucall_web: Refreshing state... [id=76db510d17ea9658c938b92a5b7fbcae]
module.EtronServiceAPI.cloudflare_record.etron_api: Refreshing state... [id=0f35a1045d7771138aa21b19aef7f343]
module.uCall.heroku_app.ucall_web: Refreshing state... [id=ucall-web]
module.LuaLepAPI.heroku_app.lualep: Refreshing state... [id=lua-lep-api]
module.uCall.heroku_app.ucall_app: Refreshing state... [id=ucall-app]
module.TestReady.heroku_app.testready: Refreshing state... [id=testready-megatunger]
module.PersonalBlog.heroku_app.megatunger_blog: Refreshing state... [id=megatunger-blog]
module.LuaLepAPI.cloudflare_record.lualep: Refreshing state... [id=d9e619af5ed3a3229b73c1179bd37a77]
module.EtronServiceAPI.heroku_app.etron_api: Refreshing state... [id=etron-service-api]
module.BinhMinhIdCardAPI.heroku_app.bmidcard_api: Refreshing state... [id=binhminh-idcard-api]
module.AIAcademyLandingPage.heroku_app.ai_academy: Refreshing state... [id=ai-academy-landing-page]
module.AIAcademyLandingPage.cloudflare_record.ai_academy: Refreshing state... [id=0a5cf682c9e6ab6f0617fed01ed0f216]
module.Edumet.heroku_app.edumet: Refreshing state... [id=edumet]
module.Edumet.cloudflare_record.edumet: Refreshing state... [id=895b92f574ab20d5099bc67e03734640]
module.Edumet.cloudflare_record.edumet_www: Refreshing state... [id=7f07a6aa62135757383a602c517435fe]
module.uCall.heroku_build.ucall_web: Refreshing state... [id=2b69cb97-5048-4537-ae83-0c4d4e6c06c5]
module.uCall.heroku_domain.ucall_web: Refreshing state... [id=e7273a6e-5220-4c61-8e17-c9261bfcd321]
module.uCall.heroku_domain.ucall_app: Refreshing state... [id=ae9d9f95-414f-4cab-ba1c-2609282ba4ad]
module.uCall.heroku_build.ucall_app: Refreshing state... [id=544fb7e7-cbf4-4846-abe6-ffa54f02b2c6]
module.LuaLepAPI.heroku_build.lualep: Refreshing state... [id=8f168cb6-c51e-4f6a-a8d0-2594681b7c16]
module.LuaLepAPI.heroku_domain.lualep: Refreshing state... [id=54cfdaca-219d-472c-a4c1-dcbd8d18f5e2]
module.TestReady.heroku_addon.database: Refreshing state... [id=3a3dfb0f-7372-439c-9263-4906fbd57f43]
module.TestReady.heroku_domain.testready: Refreshing state... [id=4853ba53-4640-44cd-8bca-78b3e07c10e1]
module.TestReady.heroku_domain.www_testready: Refreshing state... [id=fab695c8-ee64-4530-abef-ba4ea9141f6e]
module.TestReady.heroku_addon.redis: Refreshing state... [id=36d41931-c9a0-4941-89b3-2a1e085d695a]
module.EtronServiceAPI.heroku_domain.etron_api: Refreshing state... [id=0c7fe181-dcac-408f-8b44-84d07f9a3fda]
module.EtronServiceAPI.heroku_build.etron_api: Refreshing state... [id=3dcf0133-e420-46a6-b77f-4a07f31f3840]
module.PersonalBlog.heroku_build.megatunger_blog: Refreshing state... [id=e908dbbc-5c5d-48cf-853f-2be1b3547987]
module.TestReady.heroku_build.testready: Refreshing state... [id=7f8dabbc-8eba-4464-b65d-f31f0fa43c9c]
module.PersonalBlog.heroku_domain.megatunger_blog: Refreshing state... [id=a69d9820-bf34-41d1-93d7-43b90cb17098]
module.BinhMinhIdCardAPI.heroku_build.bmidcard_api: Refreshing state... [id=ecb8f54e-69c9-4342-b1d8-e6c6d03f0796]
module.BinhMinhIdCardAPI.heroku_domain.bmidcard_api: Refreshing state... [id=63afcda1-ddd2-480d-97fe-d6ed20816909]
module.PersonalBlog.heroku_domain.www_megatunger_blog: Refreshing state... [id=c24ce942-25fc-496c-9ce7-ac0e85a9cf44]
module.AIAcademyLandingPage.heroku_domain.ai_academy: Refreshing state... [id=bd9b6796-5555-4972-9f12-0d8faff05831]
module.AIAcademyLandingPage.heroku_build.ai_academy: Refreshing state... [id=f3fd68ea-b408-4591-a4da-c2914d27ab5c]
module.Edumet.heroku_domain.edumet: Refreshing state... [id=212abe17-1a8c-40d7-99c4-8207c7d59561]
module.Edumet.heroku_build.edumet: Refreshing state... [id=eaa9eb6d-ae15-44e5-a1b4-504dbd1f93b6]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.SolveX.cloudflare_record.sendgrid_1 will be created
  + resource "cloudflare_record" "sendgrid_1" {
      + created_on  = (known after apply)
      + hostname    = (known after apply)
      + id          = (known after apply)
      + metadata    = (known after apply)
      + modified_on = (known after apply)
      + name        = "s1._domainkey"
      + proxiable   = (known after apply)
      + proxied     = false
      + ttl         = (known after apply)
      + type        = "CNAME"
      + value       = "s1.domainkey.u15222697.wl198.sendgrid.net"
      + zone_id     = "aca3b9abd9599c415584a6502e83bad2"
    }

  # module.SolveX.cloudflare_record.sendgrid_2 will be created
  + resource "cloudflare_record" "sendgrid_2" {
      + created_on  = (known after apply)
      + hostname    = (known after apply)
      + id          = (known after apply)
      + metadata    = (known after apply)
      + modified_on = (known after apply)
      + name        = "s2._domainkey"
      + proxiable   = (known after apply)
      + proxied     = false
      + ttl         = (known after apply)
      + type        = "CNAME"
      + value       = "s2.domainkey.u15222697.wl198.sendgrid.net"
      + zone_id     = "aca3b9abd9599c415584a6502e83bad2"
    }

  # module.SolveX.cloudflare_record.sendgrid_3 will be created
  + resource "cloudflare_record" "sendgrid_3" {
      + created_on  = (known after apply)
      + hostname    = (known after apply)
      + id          = (known after apply)
      + metadata    = (known after apply)
      + modified_on = (known after apply)
      + name        = "em773"
      + proxiable   = (known after apply)
      + proxied     = false
      + ttl         = (known after apply)
      + type        = "CNAME"
      + value       = "u15222697.wl198.sendgrid.net"
      + zone_id     = "aca3b9abd9599c415584a6502e83bad2"
    }

  # module.SolveX.cloudflare_record.solvex will be created
  + resource "cloudflare_record" "solvex" {
      + created_on  = (known after apply)
      + hostname    = (known after apply)
      + id          = (known after apply)
      + metadata    = (known after apply)
      + modified_on = (known after apply)
      + name        = "@"
      + proxiable   = (known after apply)
      + proxied     = true
      + ttl         = (known after apply)
      + type        = "CNAME"
      + value       = "solve-x.herokuapp.com"
      + zone_id     = "aca3b9abd9599c415584a6502e83bad2"
    }

  # module.SolveX.cloudflare_record.www_solvex will be created
  + resource "cloudflare_record" "www_solvex" {
      + created_on  = (known after apply)
      + hostname    = (known after apply)
      + id          = (known after apply)
      + metadata    = (known after apply)
      + modified_on = (known after apply)
      + name        = "www"
      + proxiable   = (known after apply)
      + proxied     = true
      + ttl         = (known after apply)
      + type        = "CNAME"
      + value       = "solve-x.herokuapp.com"
      + zone_id     = "aca3b9abd9599c415584a6502e83bad2"
    }

  # module.SolveX.heroku_addon.database will be created
  + resource "heroku_addon" "database" {
      + app         = (known after apply)
      + config_vars = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + plan        = "heroku-postgresql:hobby-dev"
      + provider_id = (known after apply)
    }

  # module.SolveX.heroku_addon.redis will be created
  + resource "heroku_addon" "redis" {
      + app         = (known after apply)
      + config_vars = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + plan        = "heroku-redis:hobby-dev"
      + provider_id = (known after apply)
    }

  # module.SolveX.heroku_app.solvex will be created
  + resource "heroku_app" "solvex" {
      + acm                   = (known after apply)
      + all_config_vars       = (sensitive value)
      + buildpacks            = (known after apply)
      + config_vars           = {
          + "AWS_ACCESS_KEY_ID"     = "AKIASCN4LXWN6AO74A4X"
          + "AWS_BUCKET"            = "solve-x"
          + "AWS_REGION"            = "ap-southeast-1"
          + "AWS_SECRET_ACCESS_KEY" = "LBmzEMzYG3vNB22ZZY+PIMu7ey9gbe49HVPv8miA"
        }
      + git_url               = (known after apply)
      + heroku_hostname       = (known after apply)
      + id                    = (known after apply)
      + internal_routing      = (known after apply)
      + name                  = "solve-x"
      + region                = "eu"
      + sensitive_config_vars = (sensitive value)
      + stack                 = (known after apply)
      + uuid                  = (known after apply)
      + web_url               = (known after apply)
    }

  # module.SolveX.heroku_build.solvex will be created
  + resource "heroku_build" "solvex" {
      + app               = (known after apply)
      + buildpacks        = [
          + "https://github.com/heroku/heroku-buildpack-ruby.git",
          + "https://github.com/heroku/heroku-buildpack-activestorage-preview",
        ]
      + id                = (known after apply)
      + local_checksum    = (known after apply)
      + output_stream_url = (known after apply)
      + release_id        = (known after apply)
      + slug_id           = (known after apply)
      + source            = {
          + "url" = "https://api.github.com/repos/megatunger/OdingsProject/tarball?access_token=2979285c8a761ceeac7728268f8c4f82ebe372e0"
        }
      + stack             = (known after apply)
      + status            = (known after apply)
      + user              = (known after apply)
      + uuid              = (known after apply)
    }

  # module.SolveX.heroku_domain.solvex will be created
  + resource "heroku_domain" "solvex" {
      + app      = (known after apply)
      + cname    = (known after apply)
      + hostname = "solvex.edu.vn"
      + id       = (known after apply)
    }

  # module.SolveX.heroku_domain.www_solvex will be created
  + resource "heroku_domain" "www_solvex" {
      + app      = (known after apply)
      + cname    = (known after apply)
      + hostname = "www.solvex.edu.vn"
      + id       = (known after apply)
    }

Plan: 11 to add, 0 to change, 0 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.

```
</details>
*Pusher: @megatunger, Action: `pull_request`*